documents/UnitTestCase/API_Testing/SOAP_REQ_RES_XML/ChangeInventorystatus/changeInventoryStatus_SUCCESS_REQUEST.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.bl.cpe.elitecore.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ws:changeInventoryStatus>
         <!--Zero or more repetitions:-->
         <arg0>
            <!--Optional:-->
            <inventoryNo>sjh000000001</inventoryNo>
            <!--Optional:-->
            <newStatus>2</newStatus>
            <!--Optional:-->
            <oldStatus>5</oldStatus>
            <!--Optional:-->
            <orderLineItemID/>
            <!--Optional:-->
            <remarks>TEST</remarks>
            <!--Optional:-->
            <serialNumber/>
         </arg0>
      <arg0>
            <!--Optional:-->
            <inventoryNo>sjh000000012</inventoryNo>
            <!--Optional:-->
            <newStatus>6</newStatus>
            <!--Optional:-->
            <oldStatus/>
            <!--Optional:-->
            <orderLineItemID/>
            <!--Optional:-->
            <remarks>CHANGEINVENTORYSTATUS</remarks>
            <!--Optional:-->
            <serialNumber/>
         </arg0>
      </ws:changeInventoryStatus>
   </soapenv:Body>
</soapenv:Envelope>